app/Http/Controllers/AdminController.php

select * from `statistics_view` limit 1
---
    public function admin()
    {
        $statistics = DB::table('statistics_view')->first();