app/Http/Controllers/OfferController.php

    public function index()
    {
        $offers = Offer::all();
---
select * from `offers`

    public function store(Request $request)
    {

        $validatedData = $request->validate([
            'product_name' => 'required',
            'monthly_cost' => 'required|numeric|min:0',
            'additional_cost' => 'required|numeric|min:0',
            'internet_package_quantity' => 'required|numeric|min:0',
            'sms_quantity' => 'required|numeric|min:0',
            'mms_quantity' => 'required|numeric|min:0',
            'calls_quantity' => 'required|numeric|min:0',
            'internet_speed' => 'required',
            'roaming_available' => 'required|boolean',
        ]);

        $offer = Offer::create($validatedData);
---
insert into `offers` (`product_name`, `monthly_cost`, `additional_cost`, `internet_package_quantity`, `sms_quantity`, `mms_quantity`, `calls_quantity`, `internet_speed`, `roaming_available`, `updated_at`, `created_at`) values ('Testprod', '25.99', '10.00', '0', '0', '0', '0', '0', '1', '2023-06-26 13:09:37', '2023-06-26 13:09:37')

    public function update(Request $request, Offer $offer)
    {
        $validatedData = $request->validate([
            'product_name' => 'required',
            'monthly_cost' => 'required|numeric|min:0',
            'additional_cost' => 'required|numeric|min:0',
            'internet_package_quantity' => 'required|numeric|min:0',
            'sms_quantity' => 'required|numeric|min:0',
            'mms_quantity' => 'required|numeric|min:0',
            'calls_quantity' => 'required|numeric|min:0',
            'internet_speed' => 'required',
            'roaming_available' => 'required|boolean',
        ]);


        $offer->update($validatedData);
---
update `offers` set `internet_package_quantity` = '1000', `internet_speed` = '360', `offers`.`updated_at` = '2023-06-26 13:10:12' where `id` = 13