app/Http/Controllers/OrderController.php

    public function index()
    {
        $orders = Order::all();
---
select * from `orders`

    public function store(Request $request)
{
    $validatedData = $request->validate([
        'user_id' => 'required',
        'order_date' => 'required|date',
        'payment_end_date' => 'required|date',
        'payment_method' => 'required',
        'offer_id' => 'required',
    ]);

    $order = Order::create($validatedData);
---
insert into `orders` (`user_id`, `order_date`, `payment_end_date`, `payment_method`, `offer_id`, `updated_at`, `created_at`) values ('4', '2023-06-26', '2023-06-26', 'BLIK', '6', '2023-06-26 13:12:24', '2023-06-26 13:12:24')