app/Http/Controllers/UserController.php

    public function index()
    {
        $users = User::all();
---
select * from `users`

    public function update(Request $request, User $user)
    {
        $validatedData = $request->validate([
            'name' => 'required|max:30',
            'surname' => 'required|max:50',
            'email' => 'required|email|unique:users,email,'.$user->id.'|max:50',
            'password' => 'nullable|min:6',
            'address' => 'required|max:30',
            'postal_code' => 'required|max:6',
            'city' => 'required|max:20',
            'role_id' => 'required|exists:roles,id',
        ]);

        if ($request->filled('password')) {
            $validatedData['password'] = Hash::make($validatedData['password']);
        } else {
            unset($validatedData['password']);
        }

        $user->update($validatedData);
---
update `users` set `password` = '$2y$10$FZLsHfX0a5RX/dtJf18dSuxEpjKnOUq/seBg8BybMtktNgRiIORxK', `users`.`updated_at` = '2023-06-25 22:52:37' where `id` = 4